TestingTool_3-0/src/Catalogs/Задания/Задания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задания</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗадания</name>
    <type>
      <types>CatalogRef.ГруппыЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПеременныеПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонструктора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьКонструктором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестируемыйКлиент</name>
    <type>
      <types>CatalogRef.ТестируемыеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаГорлышка</name>
    <comment>Максимальное одновременное количество заданий в работе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>EnumRef.РежимыРаботыЗаданий</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Enums/РежимыРаботыЗаданий/РежимыРаботыЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыРаботыЗаданий</name>
  <enumValues>
    <name>ПоПорядку</name>
  </enumValues>
  <enumValues>
    <name>Воронка</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Catalogs/Задания/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторКонструктора) Тогда
	//	Элементы.ГруппаКонструктора.Видимость = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьВидимостьШириныГорлышка();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ID) Тогда
		Объект.ID = СценарноеТестированиеКлиентСервер.СформироватьАвтоматическиИдентификаторТеста(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	ИзменитьВидимостьШириныГорлышка();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьШириныГорлышка()
	Если Объект.РежимРаботы=ПредопределенноеЗначение("Перечисление.РежимыРаботыЗаданий.Воронка") Тогда
		Элементы.ШиринаГорлышка.Видимость = Истина;
	Иначе
		Элементы.ШиринаГорлышка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
